# CLEANING - PROYECTO SQL

Importamos las librer√≠as que puede nos sean necesarias para empezar con la limpieza.

In [1]:
import pandas as pd
import numpy as np
import statistics as stats
import pandas as pd
import numpy as np
import statistics as stats

import warnings
warnings.filterwarnings('ignore')

import pylab as plt
import seaborn as sns

# Cleaning ACTOR

In [2]:
actor = pd.read_csv('../data/actor.csv', encoding = 'latin1')

Importamos el dataframe del csv actor.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [3]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [4]:
actor.duplicated().any()

False

In [5]:
actor.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [6]:
actor = actor.rename(columns = {'actor_id': 'Actor_id', 'first_name': 'Name', 'last_name': 'Last_Name', 'last_update': 'Updated'})

In [7]:
actor.columns

Index(['Actor_id', 'Name', 'Last_Name', 'Updated'], dtype='object')

In [8]:
actor.head()

   Actor_id      Name     Last_Name              Updated
0         1  PENELOPE       GUINESS  2006-02-15 04:34:33
1         2      NICK      WAHLBERG  2006-02-15 04:34:33
2         3        ED         CHASE  2006-02-15 04:34:33
3         4  JENNIFER         DAVIS  2006-02-15 04:34:33
4         5    JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [9]:
actor['Name'].isnull().any()

False

In [10]:
actor['Last_Name'].isnull().any()

False

In [11]:
len(actor.Name)

200

In [12]:
len(actor.Last_Name)

200

In [13]:
actor['Name_complete'] = actor['Name'] + ' ' + actor['Last_Name']

In [14]:
actor['Name_complete'].head()

0       PENELOPE GUINESS
1          NICK WAHLBERG
2               ED CHASE
3         JENNIFER DAVIS
4    JOHNNY LOLLOBRIGIDA
Name: Name_complete, dtype: object

In [15]:
actor.head()

   Actor_id      Name     Last_Name              Updated        Name_complete
0         1  PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
1         2      NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
2         3        ED         CHASE  2006-02-15 04:34:33             ED CHASE
3         4  JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
4         5    JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [16]:
actor.isnull().any()

Actor_id         False
Name             False
Last_Name        False
Updated          False
Name_complete    False
dtype: bool

In [17]:
len(actor.Name_complete)

200

- Ahora que he creado una nueva columna con el nombre completo de los actores, voy a eliminar las columnas de 'Name' y 'Last_Name'

In [18]:
actor = actor.drop(['Name', 'Last_Name'], axis=1)

In [19]:
actor.head()

   Actor_id              Updated        Name_complete
0         1  2006-02-15 04:34:33     PENELOPE GUINESS
1         2  2006-02-15 04:34:33        NICK WAHLBERG
2         3  2006-02-15 04:34:33             ED CHASE
3         4  2006-02-15 04:34:33       JENNIFER DAVIS
4         5  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [20]:
actor['Name_complete'].value_counts()

Name_complete
SUSAN DAVIS             2
EWAN GOODING            1
DARYL CRAWFORD          1
GRETA KEITEL            1
JANE JACKMAN            1
                       ..
MICHELLE MCCONAUGHEY    1
ADAM GRANT              1
SEAN WILLIAMS           1
GARY PENN               1
THORA TEMPLE            1
Name: count, Length: 199, dtype: int64

In [21]:

# vemos que SUSAN DAVIS est√° duplicado

# vamos a eliminar este valor duplicado para que no nos de problemas posteriormente. 

# veo que puedo eliminar la fila donde est√° el Nombre duplicado, ya que no est√° el 'Autor_id' en ning√∫n otro DF.

In [22]:
actor['Name_complete'].duplicated().value_counts()

Name_complete
False    199
True       1
Name: count, dtype: int64

In [23]:
actor_dup = actor[actor.duplicated(subset=['Name_complete'], keep='first')]
actor_dup

     Actor_id              Updated Name_complete
109       110  2006-02-15 04:34:33   SUSAN DAVIS

In [24]:
actor = actor.drop_duplicates(subset=['Name_complete'], keep='first')

In [25]:


# una vez que elimino la fila duplicada ya solamente quedan

In [26]:
actor_dup = actor[actor.duplicated(subset=['Name_complete'], keep='first')]
actor_dup

Empty DataFrame
Columns: [Actor_id, Updated, Name_complete]
Index: []

In [27]:
actor['Name_complete'].duplicated().value_counts()

Name_complete
False    199
Name: count, dtype: int64

- La columna de Updated no la voy a eliminar, sino que voy a convertirla en una columna, unicamente con la fecha.

In [28]:
type('Updated')

str

In [29]:
actor['Updated'] = pd.to_datetime(actor['Updated'])

In [30]:
actor['Date'] = actor['Updated'].dt.date
actor['Time'] = actor['Updated'].dt.time

In [31]:
actor = actor.drop(['Updated', 'Time'], axis=1)

In [32]:
actor.head()

   Actor_id        Name_complete        Date
0         1     PENELOPE GUINESS  2006-02-15
1         2        NICK WAHLBERG  2006-02-15
2         3             ED CHASE  2006-02-15
3         4       JENNIFER DAVIS  2006-02-15
4         5  JOHNNY LOLLOBRIGIDA  2006-02-15

# Cleaning CATEGORY

In [33]:
cat = pd.read_csv('../data/category.csv', encoding = 'latin1')

Importamos el dataframe del csv category.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [34]:
cat

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [35]:
cat.isnull().any()

category_id    False
name           False
last_update    False
dtype: bool

In [36]:
cat.duplicated().any()

False

In [37]:
cat = cat.drop(['last_update'], axis=1)

In [38]:
cat.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [39]:
cat = cat.rename(columns = {'name': 'Category'})

In [40]:
cat.head()

   category_id   Category
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

# Cleaning FILM

Importamos el dataframe del csv film.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [41]:
film_df = pd.read_csv('../data/film.csv', encoding = 'latin1')

In [42]:
film_df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [43]:
film_df.duplicated().any()

False

In [44]:
film_df['language_id'].nunique() == 1

True

In [45]:
film_df['release_year'].nunique() == 1

True

In [46]:
film_df.isnull().any()

film_id                 False
title                   False
description             False
release_year            False
language_id             False
original_language_id     True
rental_duration         False
rental_rate             False
length                  False
replacement_cost        False
rating                  False
special_features        False
last_update             False
dtype: bool

In [47]:
film_df.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [48]:
film_df['original_language_id'].isnull().all()

True

### Eliminamos nulos y repetidos

-  Elimino aquellas columnas que tienen valores iguales y repetidos. 

-  Adem√°s, la columna 'original_language_id' tiene todos los valores nulos, por lo que tambi√©n la eliminamos.

In [49]:
film_df = film_df.drop(['release_year', 'language_id', 'original_language_id', 'last_update', 'rental_rate'], axis=1)

In [50]:
film_df.columns

Index(['film_id', 'title', 'description', 'rental_duration', 'length',
       'replacement_cost', 'rating', 'special_features'],
      dtype='object')

In [51]:
film_df.head()

,film_id,title,description,rental_duration,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,130,22.99,G,Deleted Scenes

In [52]:
film_df['special_features'].nunique()

15

### Limpiamos columnas

- Como el titulo de las columnas est√° en may√∫sculas, por si alguno de las letras no es may√∫scula, voy a hacer una comprobaci√≥n y un cambio de todo a MAY√öSCULAS.

In [53]:
if not film_df['title'].str.isupper().all():
    
    film_df['title'] = film_df['title'].str.upper()

In [54]:
if not film_df['special_features'].str.islower().all():
    
    film_df['special_features'] = film_df['special_features'].str.lower()

In [55]:
film_df.head()

,film_id,title,description,rental_duration,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,86,20.99,PG,"deleted scenes,behind the scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,48,12.99,G,"trailers,deleted scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,50,18.99,NC-17,"trailers,deleted scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,117,26.99,G,"commentaries,behind the scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,130,22.99,G,deleted scenes

In [56]:
film_df['rating'].value_counts()

rating
PG-13    223
NC-17    210
R        195
PG       194
G        178
Name: count, dtype: int64

- Para que sea m√°s sencillo, he adaptado un orden del 1 al 5 en los 'rating' de las pel√≠culas.

In [57]:
rating_dict = {'PG-13': 1, 'NC-17': 2, 'R': 3, 'PG': 4, 'G': 5}

film_df['rating'] = film_df['rating'].replace(rating_dict)

In [58]:
film_df.head()

,film_id,title,description,rental_duration,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,86,20.99,4,"deleted scenes,behind the scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,48,12.99,5,"trailers,deleted scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,50,18.99,2,"trailers,deleted scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,117,26.99,5,"commentaries,behind the scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,130,22.99,5,deleted scenes

In [59]:
type('replacement_cost')

str

- Cambio el 'replacement_cost' a numeros enteros, ya que el valor anterior ensucia la tabla final. 
- Para ello se pasa el valor a entero mientras redondeamos el n√∫mero dado al n√∫mero entero m√°s cercano.

In [60]:
film_df['replacement_cost'] = round(film_df['replacement_cost']).astype(int)

In [61]:
film_df.head()

,film_id,title,description,rental_duration,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,86,21,4,"deleted scenes,behind the scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,48,13,5,"trailers,deleted scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,50,19,2,"trailers,deleted scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,117,27,5,"commentaries,behind the scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,130,23,5,deleted scenes

# Cleaning INVENTORY

Importamos el dataframe del csv inventory.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

- Elimino aquellas columnas que tienen valores iguales y repetidos.

In [62]:
inv = pd.read_csv('../data/inventory.csv', encoding = 'latin1')

In [63]:
inv.duplicated().any()

False

In [64]:
inv['film_id'].count()

1000

In [65]:
inv.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [66]:
inv = inv.drop(['last_update'], axis=1)

In [67]:
inv.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

# Cleaning LANGUAGE

Importamos el dataframe del csv language.csv

Observamos si tiene: 
 - Duplicados
 - Nulos
 
Renombramos la columna 'name' para que sea m√°s visual y facil de utilizar posteriormente

In [68]:
lang = pd.read_csv('../data/language.csv', encoding = 'latin1')

In [69]:
lang

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [70]:
lang = lang.drop(['last_update'], axis=1)

In [71]:
lang = lang.rename(columns = {'name': 'Language'})

In [72]:
lang

   language_id  Language
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French
5            6    German

# Cleaning old_HDD

Importamos el dataframe del csv language.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [73]:
old = pd.read_csv('../data/old_HDD.csv', encoding = 'latin1')

In [74]:
old.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [75]:
old.duplicated().any()

False

In [76]:
old.isnull().any()

first_name      False
last_name       False
title           False
release_year    False
category_id     False
dtype: bool

In [77]:
old.count()

first_name      1000
last_name       1000
title           1000
release_year    1000
category_id     1000
dtype: int64

In [78]:
old['release_year'].nunique() == 1

True

- Los valores de la columna 'release_year' son √∫nicos, por lo que voy a eliminar esta columna.

In [79]:
old = old.drop(['release_year'], axis=1)

In [80]:
old.columns

Index(['first_name', 'last_name', 'title', 'category_id'], dtype='object')

In [81]:
old = old.rename(columns = {'first_name': 'Name', 'last_name': 'Last_Name', 'title': 'Title'})

In [82]:
old.head()

       Name Last_Name                  Title  category_id
0  PENELOPE   GUINESS       ACADEMY DINOSAUR            6
1  PENELOPE   GUINESS   ANACONDA CONFESSIONS            2
2  PENELOPE   GUINESS            ANGELS LIFE           13
3  PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10
4  PENELOPE   GUINESS          CHEAPER CLYDE           14

In [83]:
old['Name_complete'] = old['Name'] + ' ' + old['Last_Name']

In [84]:
old.head()

       Name Last_Name                  Title  category_id     Name_complete
0  PENELOPE   GUINESS       ACADEMY DINOSAUR            6  PENELOPE GUINESS
1  PENELOPE   GUINESS   ANACONDA CONFESSIONS            2  PENELOPE GUINESS
2  PENELOPE   GUINESS            ANGELS LIFE           13  PENELOPE GUINESS
3  PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS
4  PENELOPE   GUINESS          CHEAPER CLYDE           14  PENELOPE GUINESS

In [85]:
old = old.drop(['Name', 'Last_Name'], axis=1)

In [86]:
old.head()

                   Title  category_id     Name_complete
0       ACADEMY DINOSAUR            6  PENELOPE GUINESS
1   ANACONDA CONFESSIONS            2  PENELOPE GUINESS
2            ANGELS LIFE           13  PENELOPE GUINESS
3  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS
4          CHEAPER CLYDE           14  PENELOPE GUINESS

In [87]:
len(old['Title'].duplicated())

1000

In [88]:
old['Title'].value_counts()

Title
BOONDOCK BALLROOM     6
FLASH WARS            5
STRANGER STRANGERS    5
OKLAHOMA JUMANJI      5
CHITTY LOCK           5
                     ..
FLYING HOOK           1
EGYPT TENENBAUMS      1
BUTCH PANTHER         1
TYCOON GATHERING      1
EXORCIST STING        1
Name: count, Length: 614, dtype: int64

In [89]:
# hay duplicados en los nombres de los t√≠tulos porque m√°s de un 'actor', est√° en un mismo 'Title'

- Le voy a poner un √≠ndice al dataframe 'old'. 
- Esto me facilitar√° su uso posterior en SQL

In [90]:
old['old_id'] = range(1, len(old)+1)

In [91]:
old.head()

                   Title  category_id     Name_complete  old_id
0       ACADEMY DINOSAUR            6  PENELOPE GUINESS       1
1   ANACONDA CONFESSIONS            2  PENELOPE GUINESS       2
2            ANGELS LIFE           13  PENELOPE GUINESS       3
3  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS       4
4          CHEAPER CLYDE           14  PENELOPE GUINESS       5

In [92]:
column_order = ['old_id', 'Title', 'Name_complete', 'category_id']

In [93]:
old = old.reindex(columns=column_order)

In [94]:
old.head()

   old_id                  Title     Name_complete  category_id
0       1       ACADEMY DINOSAUR  PENELOPE GUINESS            6
1       2   ANACONDA CONFESSIONS  PENELOPE GUINESS            2
2       3            ANGELS LIFE  PENELOPE GUINESS           13
3       4  BULWORTH COMMANDMENTS  PENELOPE GUINESS           10
4       5          CHEAPER CLYDE  PENELOPE GUINESS           14

In [95]:
old = old.set_index('old_id')

- A√±ado la columna 'Actor_id' en la tabla 'old'. Esto puedo hacerlo ya que tengo un elemento com√∫n entre ambas tablas, el 'Name_complete' est√° en ambas columnas.

In [96]:
# Seleccionar las columnas que deseas mantener en la tabla resultante y renombrarlas seg√∫n sea necesario

In [97]:
old = old.merge(actor[['Name_complete', 'Actor_id']], on = 'Name_complete', how = 'left') 
old.head()

                   Title     Name_complete  category_id  Actor_id
0       ACADEMY DINOSAUR  PENELOPE GUINESS            6         1
1   ANACONDA CONFESSIONS  PENELOPE GUINESS            2         1
2            ANGELS LIFE  PENELOPE GUINESS           13         1
3  BULWORTH COMMANDMENTS  PENELOPE GUINESS           10         1
4          CHEAPER CLYDE  PENELOPE GUINESS           14         1

# Cleaning RENTAL

In [98]:
rent = pd.read_csv('../data/rental.csv', encoding = 'latin1')

In [99]:
rent.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [100]:
rent.duplicated().any()

False

In [101]:
rent.isnull().any()

rental_id       False
rental_date     False
inventory_id    False
customer_id     False
return_date     False
staff_id        False
last_update     False
dtype: bool

- No hay nulos
- No hay filas duplicadas.

In [102]:
rent = rent.drop(['last_update'], axis=1)

In [103]:
rent.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [104]:
column_order = ['rental_id', 'inventory_id', 'customer_id', 'staff_id', 'rental_date', 'return_date']

In [105]:
rent = rent.reindex(columns=column_order)

In [106]:
rent.head()

,rental_id,inventory_id,customer_id,staff_id,rental_date,return_date
0,1,367,130,1,2005-05-24 22:53:30,2005-05-26 22:04:30
1,2,1525,459,1,2005-05-24 22:54:33,2005-05-28 19:40:33
2,3,1711,408,1,2005-05-24 23:03:39,2005-06-01 22:12:39
3,4,2452,333,2,2005-05-24 23:04:41,2005-06-03 01:43:41
4,5,2079,222,1,2005-05-24 23:05:21,2005-06-02 04:33:21

### Observo ahora las columnas de cada uno de los DataFrame, para ver la relaci√≥n final de todos estos.

In [107]:
actor.columns

Index(['Actor_id', 'Name_complete', 'Date'], dtype='object')

In [108]:
lang.columns

Index(['language_id', 'Language'], dtype='object')

In [109]:
film_df.columns

Index(['film_id', 'title', 'description', 'rental_duration', 'length',
       'replacement_cost', 'rating', 'special_features'],
      dtype='object')

In [110]:
inv.columns

Index(['inventory_id', 'film_id', 'store_id'], dtype='object')

In [111]:
cat.columns

Index(['category_id', 'Category'], dtype='object')

In [112]:
old.columns

Index(['Title', 'Name_complete', 'category_id', 'Actor_id'], dtype='object')

In [113]:
rent.columns

Index(['rental_id', 'inventory_id', 'customer_id', 'staff_id', 'rental_date',
       'return_date'],
      dtype='object')

0    1
1    2
2    3
3    4
4    5
Name: inventory_id, dtype: int64